{
  "about": {
    "title": "Sobre Mim",
    "timeline": {
      "august2018": "Formada como Engenheira de Biossistemas, Universidade de São Paulo",
      "april2020": "Completou o programa Women Can Code, fazendo transição para a tecnologia",
      "june2020": "Ingressou na Venturus como Desenvolvedora Frontend Júnior",
      "december2021": "Promovida a Desenvolvedora Frontend Pleno na Venturus",
      "march2022": "Iniciou Especialização em Engenharia de Software",
      "may2022": "Iniciou experiência internacional na Farfetch",
      "june2022": "Construiu uma ferramenta interna para otimizar fluxos de trabalho usando JavaScript, jQuery, Bootstrap e CSS",
      "october2023_1": "Obteve Certificação de Pós-Graduação em Engenharia de Software",
      "october2023_2": "Reconstruiu e escalou a ferramenta interna usando React, SCSS e Firebase",
      "march2024": "Formou e orientou um novo desenvolvedor web, fortalecendo as capacidades da equipa"
    },
    "labels": {
      "august2018": "Agosto 2018",
      "april2020": "Abril 2020",
      "june2020": "Junho 2020",
      "december2021": "Dezembro 2021",
      "march2022": "Março 2022",
      "may2022": "Maio 2022",
      "june2022": "Junho 2022",
      "october2023": "Outubro 2023",
      "march2024": "Março 2024"
    }
  },
  "contact": {
    "title": "Contato",
    "content": {
      "email": {
        "label": "E-mail",
        "linkText": "marilia.andrad@gmail.com"
      },
      "linkedin": {
        "label": "Perfil no LinkedIn",
        "linkText": "Perfil no LinkedIn"
      },
      "github": {
        "label": "Conta no GitHub",
        "linkText": "Conta no GitHub"
      },
      "resume": {
        "label": "Baixar Currículo",
        "linkText": "Baixar Currículo"
      },
      "whatsapp": {
        "label": "WhatsApp",
        "linkText": "WhatsApp"
      }
    }
  },
  "projects": {
    "title": "Projetos",
    "skillsTitle": "Competências",
    "list": [
      {
        "title": "Aplicação Web Interna para a Farfetch",
        "description": "Desenvolvi uma aplicação web interna para substituir um processo baseado em folhas de cálculo na Farfetch.",
        "responsibilities": "Inicialmente construí a aplicação usando JavaScript puro. Reconstruída com React e SCSS à medida que a aplicação cresceu. Integrei serviços de backend usando Firebase. Atualmente lidero a formação de um novo programador web.",
        "stack": "JavaScript, jQuery, Bootstrap, CSS, React, SCSS, Firebase"
      },
      {
        "title": "Desenvolvimento Frontend na Venturus",
        "description": "Trabalhei em vários projetos como parte de uma equipa baseada em Scrum e, mais tarde, em SAFe na Venturus.",
        "responsibilities": "Desenvolvi e mantive aplicações frontend usando React, Redux e TypeScript. Interagi com APIs REST e assegurei a qualidade do código através de revisões e testes usando Jest e Cypress.",
        "stack": "React, Redux, TypeScript, APIs REST, Jest, Cypress"
      },
      {
        "title": "API Financeira",
        "description": "Um projeto pessoal publicado no RapidAPI que obtém dados de ações e criptomoedas.",
        "responsibilities": "Desenhei e implementei a API usando FastAPI e Python. Melhorei a funcionalidade para me destacar no mercado. Esta foi a minha primeira experiência com Python, onde aprendi sobre design de APIs, obtenção de dados e tratamento de erros.",
        "challenges": "Enfrentei desafios ao aprender a sintaxe do Python e as melhores práticas, implementar uma obtenção eficiente de dados e assegurar um tratamento robusto de erros.",
        "stack": "FastAPI, Python, RapidAPI"
      },
      {
        "title": "BuddyMinder",
        "description": "Desenvolvi uma extensão de Chrome baseada numa ideia pessoal para ajudar os utilizadores a memorizar informações importantes.",
        "responsibilities": "Desenvolvi a extensão com base numa ideia pessoal para melhorar a retenção de memória e o aprendizado. Desenhei uma interface elegante e de fácil utilização usando React e SCSS. Integrei o Firebase para a sincronização de dados e funcionalidade multiplataforma. Adicionei suporte multilingue (i18n) para inglês, francês, espanhol e português.",
        "challenges": "Superei desafios com as APIs de Extensão do Chrome, garantindo notificações fluidas e uma gestão eficiente de dados. Gerenciei a integração com o Firebase para atualizações em tempo real.",
        "stack": "React, SCSS, Ant Design, APIs de Extensões do Chrome"
      }
    ]
  },
  "responsibilities": "Responsabilidades",
  "challenges": "Desafios",
  "techStack": "Tecnologias",
  "skills": {
    "agile": "Metodologias Ágeis",
    "legend": {
      "favorites": "Os meus favoritos absolutos e principal área de especialização",
      "comfortable": "Sinto-me confortável, mas preciso de um refresco ocasional",
      "improving": "Já trabalhei com estas tecnologias, mas ainda estou a melhorar",
      "learning": "A caminho! Apenas a começar"
    }
  },
  "navbar": {
    "tagline": "Desenvolvedora Web"
  },
  "footer": {
    "madeWithLove": "Feito com ❤️ por Marília Franco",
    "rightsReserved": "© Todos os direitos reservados"
  },
  "navigationTabs": {
    "tabs": {
      "about": "Sobre Mim",
      "projects": "Projetos",
      "contact": "Contato"
    },
    "languageDropdown": {
      "label": "Idioma",
      "options": {
        "en": "Inglês",
        "es": "Espanhol",
        "pt-BR": "Português (Brasil)",
        "pt-PT": "Português (Portugal)"
      }
    }
  }
}
