{
  "about": {
    "title": "Sobre Mim",
    "timeline": {
      "august2018": "Formada como Engenheira de Biossistemas, Universidade de São Paulo",
      "april2020": "Conclusão do programa Women Can Code, fazendo transição para tecnologia",
      "june2020": "Contratada pelo Venturus como Desenvolvedora Frontend Júnior",
      "december2021": "Promovida a Desenvolvedora Frontend Pleno",
      "march2022": "Início da Especialização em Engenharia de Software",
      "may2022": "Nova experiência profissional como Web Developer na Farfetch (posição remota - Portugal)",
      "june2022": "Desenvolvimento de uma aplicação interna usando JavaScript, jQuery, Bootstrap e CSS",
      "october2023_1": "Conclusão da Pós-Graduação em Engenharia de Software",
      "october2023_2": "Responsável por escalar a aplicação web utilizando React, SCSS e Firebase",
      "march2024": "Início da mentoria a um novo membro do time"
    },
    "labels": {
      "august2018": "Agosto 2018",
      "april2020": "Abril 2020",
      "june2020": "Junho 2020",
      "december2021": "Dezembro 2021",
      "march2022": "Março 2022",
      "may2022": "Maio 2022",
      "june2022": "Junho 2022",
      "october2023": "Outubro 2023",
      "march2024": "Março 2024"
    }
  },
  "contact": {
    "title": "Contato",
    "linkedin": "Perfil no LinkedIn",
    "github": "Conta no GitHub",
    "resume": "Baixar Currículo"
  },
  "projects": {
    "title": "Projetos",
    "skillsTitle": "Habilidades",
    "list": [
      {
        "title": "Desenvolvimento Web na Farfetch",
        "description": "Planejamento e desenvolvimento de uma aplicação web para substituir um processo interno baseado em planilhas",
        "responsibilities": "Inicialmente foi desenvolvida uma aplicação usando Vanilla JavaScript. Com a necessidade de ser escalada, uma nova aplicação foi desenvolvida com React e SCSS. Para integração de serviços backend foi utilizado o Firebase. Atualmente lidero o treinamento de um novo desenvolvedor web.",
        "stack": "JavaScript, jQuery, Bootstrap, CSS, React, SCSS, Firebase"
      },
      {
        "title": "Desenvolvimento Frontend no Venturus",
        "description": "Participação em dois projetos, o primeiro em uma equipe baseada em Scrum e, mais tarde, em SAFe..",
        "responsibilities": "Desenvolvimento e manutenção de aplicações frontend usando React, Redux e TypeScript. Integração com APIs REST, testes usando Jest e Cypress e entrega de código baseada em code-review.",
        "stack": "React, Redux, TypeScript, APIs REST, Jest, Cypress"
      },
      {
        "title": "API Financeira",
        "description": "Um projeto pessoal publicado no RapidAPI que obtém dados de ações e criptomoedas em tempo real",
        "responsibilities": "Minha primeira experiência com Python, com foco em aprender sobre a linguagem e implementação de uma API.",
        "stack": "FastAPI, Python, RapidAPI",
        "link": "https://github.com/mariliafranco/financial-api"
      },
      {
        "title": "BuddyMinder",
        "description": "Desenvolvimento de uma extensão do Chrome para ajudar na memorização de informações importantes.",
        "responsibilities": "Implementação de um plugin com base em uma ideia pessoal para melhorar a retenção de memória e o aprendizado, com o mínimo esforço do usuário a partir de notificações constantes.",
        "stack": "React, SCSS, Ant Design, i18n, Firebase, APIs de Extensões do Chrome",
        "link": "https://github.com/mariliafranco/buddyMinder"
      }
    ]
  },
  "responsibilities": "Responsabilidades",
  "challenges": "Desafios",
  "techStack": "Tecnologias",
  "skills": {
    "agile": "Metodologias Ágeis",
    "legend": {
      "favorites": "São meus favoritos e minha principal área de especialização",
      "comfortable": "Me sinto confortável, mas preciso revisar ocasionalmente",
      "improving": "Já trabalhei com essas tecnologias, mas ainda estou melhorando",
      "learning": "Acabei de começar, mas estou no caminho!"
    }
  },
  "navbar": {
    "tagline": "Desenvolvedora Frontend"
  },
  "footer": {
    "madeWithLove": "Feito com ❤️ por Marília Franco",
    "rightsReserved": "© Todos os direitos reservados"
  },
  "navigationTabs": {
    "tabs": {
      "about": "Sobre Mim",
      "projects": "Projetos",
      "contact": "Contato"
    },
    "languageDropdown": {
      "label": "Idioma",
      "options": {
        "en": "Inglês",
        "es": "Espanhol",
        "pt-BR": "Português (BR)",
        "pt-PT": "Português (PT)"
      }
    }
  }
}
